app/controllers/welcome_controller.rb

  def index
    @countries = Country.all
    @cities = City.where("country_id = ?", Country.first.id)
---
SELECT  "countries".* FROM "countries"  ORDER BY "countries"."id" ASC LIMIT 1
SELECT "cities".* FROM "cities" WHERE (country_id = 1)

  def update_cities
    @cities = City.where("country_id = ?", params[:country_id])
---
SELECT "cities".* FROM "cities" WHERE (country_id = '2')